# Данные по равновесию абсорбат-пооглотитель

def H2S_selexol():
    '''кубосантиметры на грамм'''
    t = (25, 75)
    p = (0.01,0.05,0.10,0.50,1.0,1.50)
    alpha = (((0.3,1.5,3.0,14.9,29.9,44.8), p),
             ((0.9,), (0.1,))
             )
    alpha_dim = 'м³/м³'
    p_dim = 'МПа'
    # коэффициент перевода
    # при сборке массива для построения графика выкинуть нули
    return t, alpha, alpha_dim, p_dim


def CO2_CH3OH():
    '''кубосантиметры на грамм'''
    t = (-26,-36,-45,-60)
    p = (0.0981,0.1961,0.2942,0.4903,0.6865,0.9806)
    alpha = (((17.6,36.2,55,106,155,208), p),
             ((23.7,49.8,77.4,150,262,610), p),
             ((35.9,72.6,117,250,570), p[0:-1]),
             ((68,159,321.4), p[0:-3]))
    alpha_dim = 'см³/г'
    p_dim = 'МПа'
    # коэффициент перевода
    # при сборке массива для построения графика выкинуть нули
    return t, alpha, alpha_dim, p_dim

def CO2_PK_C4H6O3():
    t = (15,25,45,75)
    p = (0.1013,0.2027,0.4053,0.608,0.8106,1.0133,2.027,3.04)
    alpha =(((3.88,8,16.5,24.7,32.8,41,100,185), p),
            ((3.09,6.5,13,19.9,26.5,33.5,75,132), p),
            ((2.32,4,8.7,13.7,19.3,25,53.5,87.5), p),
            ((0,0,0,0,0,13.2,32.5,51.2), p)
            )
    alpha_dim = 'м³/м³'
    p_dim = 'МПа'
    return t, alpha, alpha_dim, p_dim

def CO2_C6H9ON():
    t = (15, 25, 40, 90, 100)
    p = (0.1013, 0.2027, 0.4053, 0.608, 0.8106, 1.0133, 2.027, 3.04)  #   0.1013, 0.2027, 0.4053, 0.4545, 0.7026, 0.8817, 2.027, 3.04
    alpha = (((4.5, 8.7, 27.7, 39, 52, 140, 230), p[0:2]+p[3:]),  #  ((4.5, 8.7, 27.7, 39, 52, 140, 230), p[0:2]+p[3:] (4.5, 8.7, 20.2, 27.7, 39, 52, 140, 230), p
             ((3.57, 7.5, 15, 22.7, 31, 40.7, 104, 190), p),
             ((2.7, 5.5, 11.6, 17.8, 24.9, 32.5, 72), p[0:-1]),
             ((1.33, 0, 0, 0, 0, 0, 0, 0), p),
             ((0.97, 0, 0, 0, 0, 0, 0, 0), p)
             )
    alpha_dim = 'м³/м³'
    p_dim = 'МПа'
    return t, alpha, alpha_dim, p_dim

def CO2_flot_T_66():
    t = (15,25,40,75)
    p_1 = (1.8,3.42,4.48,6.84,7.6,11.24,12.24,20.8,22.92,28.08,34.96,36.48)
    p_2 = (2.65,3.45,8.65,11.45,11.9,15.45,15.8,20.65,24.65,32.25,39.4,0)
    p_3 = (3.6,4.82,6.78,8.28,14.52,16.4,18.64,20.86,26,30.34,35.56,39.24)
    p_4 = (0, )
    alpha = (((5.68,11.62,14.52,23.43,26.25,39.64,43.05,76.7,86.85,111.64,155.76,158.8), p_1),
             ((7.08,9.4,25,32.61,36.1,48.3,47.82,68.26,86.97,124.92,160.83,0), p_2),
             ((5.84,8.18,12.31,14.83,31.48,34.15,42.86,45.6,62.1,77.13,93.06,106.8), p_3),
             ((0, ), p_4)
             )
    alpha_dim = 'м³/м³'
    p_dim = 'ат'
    return t, alpha, alpha_dim, p_dim

def H2S_CH3OH():
    t = (0,-25.6,-50)
    p = (6.666,13.332,19.998,26.664,39.997,53.329)
    alpha = (((2.4,4.8,7.2,9.7,14.8,20), p),
             ((5.7,11.2,16.5,21.8,33,45.8), p),
             ((16.8,32.8,48,65.6,99.6,135.2), p)
             )
    alpha_dim = 'см³/г'
    p_dim = 'кПа'
    return t, alpha, alpha_dim, p_dim

def H2S_PK_C4H6O3():
    t = (15,25,40,100)
    p_1 = (0.0267,0.0533,0.08,0.1013)
    p_2 = (0.1013,0.185,0.639,2.189,3.594,4.96)
    alpha = (((3.6,7,10.4,12.8), p_1),
             ((2.9,5.6,8.3,10.4), p_1),
             ((2,3.9,5.6,6.9), p_1),
             ((0,1.6,15.1,75,151,293), p_2)
             )
    alpha_dim = 'м³/м³'
    p_dim = 'МПа'
    return t, alpha, alpha_dim, p_dim

def H2S_C6H9ON():
    t = (10,25,35,100)
    p = (200,400,600,760)
    alpha = (
             ((18, 34, 48, 4, 59), p),
             ((11.1, 20.9, 29.8, 35.4), p),
             ((8.4, 15.6, 21.5, 25.6), p),
             ((0, 0, 0, 7), p)
             )
    alpha_dim = 'м³/м³'
    p_dim = 'мм рт.ст.'
    return t, alpha, alpha_dim, p_dim

mixtures_list = {'сероводород-селексол': H2S_selexol,
                 'углекислый газ-метанол': CO2_CH3OH,
                 'углекислый газ-пропиленкарбонат': CO2_PK_C4H6O3,
                 'углекислый газ-метилпирролидон': CO2_C6H9ON,
                 'углекислый газ-флотореагент т-66': CO2_flot_T_66,
                 'сероводород-метанол': H2S_CH3OH,
                 'сероводород-пропиленкарбонат': H2S_PK_C4H6O3,
                 'сероводород-метилпирролидон': H2S_C6H9ON}


